# 6006
# 다음 문장을 출력하시오.

# "!@#$%^&*()'
# (단, 큰따옴표와 작은따옴표도 함께 출력한다.)

print('\"!@#$%^&*()\'')



# 6007
# 윈도우 운영체제의 파일 경로를 출력하는 연습을 해보자.
# 파일 경로에는 특수문자들이 포함된다.
# 다음 경로를 출력하시오.

# "C:\Download\'hello'.py"
# (단, 따옴표도 함께 출력한다.)

print('\"C:\\Download\\\'hello\'.py\"')



# 6008
# 출력문 연습의 마지막 문제이다.
# (생각과 시도를 많이 해야하는 문제들은 한 두 문제씩 넘겼다가 나중에 풀어보면 된다.)
# 이번에는 다음과 같은 python프로그램의 소스코드를 출력해보자.

# print("Hello\nWorld")

# 위 코드를 정확히 그대로 출력하시오.(공백문자 주의)

print('print("Hello\\nWorld")')




# 6009
# 변수에 문자 1개를 저장한 후 변수에 저장되어 있는 문자를 그대로 출력해보자.

# 예시
# c = input()
# print(c)
# 와 같은 형태로 가능하다.


c = input()
print(c)



# 6010
# 변수에 정수값을 저장한 후 정수로 변환하여 출력해보자.

# 예시
# n = input()
# n = int(n)
# print(n)
# 와 같은 형태로 가능하다.

n = int(input())
print(n)